In [1]:
import pandas as pd

In [2]:
l=pd.Series([11,23,45,67,8,9])
print(l)
dict=pd.Series({'A':1,'B':23,'C':45,'D':67})
print(dict)

0    11
1    23
2    45
3    67
4     8
5     9
dtype: int64
A     1
B    23
C    45
D    67
dtype: int64

In [3]:
di={'NAME':['A','B','C','D','E','f','g','h','i','j'],
   'DEPT':['ECE','ECE','IT','CSE','IT','it','cse','ece','eee','eee'],
   'SCORE':[68,90,80,78,87,78,58,90,34,67]}
df=pd.DataFrame(di)
df

  NAME DEPT  SCORE
0    A  ECE     68
1    B  ECE     90
2    C   IT     80
3    D  CSE     78
4    E   IT     87
5    f   it     78
6    g  cse     58
7    h  ece     90
8    i  eee     34
9    j  eee     67

In [4]:
print(df.head())
df.head(7)

  NAME DEPT  SCORE
0    A  ECE     68
1    B  ECE     90
2    C   IT     80
3    D  CSE     78
4    E   IT     87

  NAME DEPT  SCORE
0    A  ECE     68
1    B  ECE     90
2    C   IT     80
3    D  CSE     78
4    E   IT     87
5    f   it     78
6    g  cse     58

In [5]:
df.tail()

  NAME DEPT  SCORE
5    f   it     78
6    g  cse     58
7    h  ece     90
8    i  eee     34
9    j  eee     67

In [6]:
print("shape ",df.shape)
print("columns ",df.columns)
print("datatypes\n",df.dtypes)

shape  (10, 3)
columns  Index(['NAME', 'DEPT', 'SCORE'], dtype='object')
datatypes
 NAME     object
DEPT     object
SCORE     int64
dtype: object

In [7]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    10 non-null     object
 1   DEPT    10 non-null     object
 2   SCORE   10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes
None

In [8]:
df[["NAME",'DEPT']]

  NAME DEPT
0    A  ECE
1    B  ECE
2    C   IT
3    D  CSE
4    E   IT
5    f   it
6    g  cse
7    h  ece
8    i  eee
9    j  eee

In [9]:
names = ['Ram', 'John', 'Abdul','Siva', 'Adam', 'Rahman']
maths =  [45, 40, 60, 80, 90, 75]
english =[60,75,90,65,80,60]
di={'Names':names,'Maths':maths,'English':english}
sdf=pd.DataFrame(di)
sdf

    Names  Maths  English
0     Ram     45       60
1    John     40       75
2   Abdul     60       90
3    Siva     80       65
4    Adam     90       80
5  Rahman     75       60

In [11]:
sdf[sdf['Maths']>70]

    Names  Maths  English
3    Siva     80       65
4    Adam     90       80
5  Rahman     75       60

In [12]:
sdf[(sdf['English']<80) & (sdf['Maths']>70) ]

    Names  Maths  English
3    Siva     80       65
5  Rahman     75       60

In [13]:
sdf.rename(columns={'Maths':"mathematics "},inplace=True)

In [17]:
sdf.drop(columns={'English'},inplace=True)

In [18]:
sdf

    Names  mathematics
0     Ram            45
1    John            40
2   Abdul            60
3    Siva            80
4    Adam            90
5  Rahman            75

In [19]:
names = ['Ram', 'John', 'Abdul','Siva', 'Adam', 'Rahman']
maths =  [45, 40, 60, 80, 90, 75]
english =[60,75,90,65,80,60]
di={'Names':names,'Maths':maths,'English':english}
sdf=pd.DataFrame(di)
sdf

    Names  Maths  English
0     Ram     45       60
1    John     40       75
2   Abdul     60       90
3    Siva     80       65
4    Adam     90       80
5  Rahman     75       60

In [20]:
sdf.sort_values(by=['Names'],ascending=True)

    Names  Maths  English
2   Abdul     60       90
4    Adam     90       80
1    John     40       75
5  Rahman     75       60
0     Ram     45       60
3    Siva     80       65

In [30]:
p=pd.read_csv("C:\\Users\\Mahesh\\OneDrive\\ds day-1\\input.csv")
p.head()

   Empid     Name   Dept Gender     City  Salary
0      1   Samuel  Admin      M  Chennai   45000
1      2    Jerry     IT      M    Blore   75000
2      3  Michale  Sales      F      Goa   30000
3      4    Joann     IT      F  Chennai   80000
4      5   Sherin     IT      F    Blore   78000

In [42]:
print(p['Salary'].mean())
print(p['Salary'].std())
print(p['Salary'].min())
print(p['Salary'].median())
print(p['Salary'].mode())
print(p['Gender'].value_counts())
print(p['Dept'].unique())

53666.666666666664
23014.488190413154
8000
55000.0
0    45000
1    65000
Name: Salary, dtype: int64
M    8
F    7
Name: Gender, dtype: int64
['Admin' 'IT' 'Sales' 'Networks']

In [51]:
p.groupby(['Dept']).mean()

          Empid   Salary
Dept
Admin      1.00  45000.0
IT         8.25  65875.0
Networks   9.50  45000.0
Sales      8.50  35750.0

In [52]:
p.groupby(['Dept'])["Salary"].mean()

Dept
Admin       45000.0
IT          65875.0
Networks    45000.0
Sales       35750.0
Name: Salary, dtype: float64

In [53]:
p.groupby(['Gender'])["Salary"].mean()

Gender
F    59714.285714
M    48375.000000
Name: Salary, dtype: float64

In [54]:
p.groupby(['Dept'])["Salary"].min()

Dept
Admin       45000
IT           8000
Networks    35000
Sales       28000
Name: Salary, dtype: int64

In [56]:
p.groupby(['Gender'])["Salary"].sum()

Gender
F    418000
M    387000
Name: Salary, dtype: int64

In [58]:
p.groupby(['Dept'])['Gender'].value_counts()

Dept      Gender
Admin     M         1
IT        F         4
          M         4
Networks  F         1
          M         1
Sales     F         2
          M         2
Name: Gender, dtype: int64

In [63]:
p[p['Dept']=="IT"]['Gender'].value_counts()

M    4
F    4
Name: Gender, dtype: int64

In [66]:
pd.crosstab(p['Dept'],p['Gender'])

Gender    F  M
Dept
Admin     0  1
IT        4  4
Networks  1  1
Sales     2  2

In [55]:
pd.read_excel(r"C:\Users\Mahesh\OneDrive\ds day-1\employee_info.xlsx")

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600